# backend/Dockerfile

# Базовый образ Node.js. Легковесный и безопасный.
FROM node:18-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и lock-файл для установки зависимостей
# Этот шаг кэшируется, ускоряя последующие сборки, если зависимости не менялись
COPY package*.json ./

# Устанавливаем только 'production' зависимости, игнорируя devDependencies
RUN npm install --production

# Копируем весь остальной код приложения в рабочую директорию
COPY . .

# Открываем порт, на котором будет работать приложение (указан в server.js)
EXPOSE 3000

# Команда, которая будет выполнена при запуске контейнера
CMD ["node", "server.js"]